Autodesk.Revit.DB.ExternalResourceReferenceUpdatedDataForWorksharing.#ctor(Autodesk.Revit.DB.FailureDefinitionId)
Constructor data from failure id.
failureId:
The failure id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceUpdatedDataForWorksharing.#ctor(Autodesk.Revit.DB.ExternalResourceReference)
Constructor data from updated resource.
updatedReference:
The updated resource.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018